Repository: wp-plugins/wp-picturehoster
Catalog: wp-picturehoster-*.po
Languages: de_de

source: Submit
de_de: Abschicken

source: You have to be logged in to use this service
de_de: Sie müssen angemeldet sein um den Service zu nutzen

source: Link to your image
de_de: Link zum Bild

source: path/to/large/file
de_de: pfad/zur/datei

source: path/to/thumbnail
de_de: pfad/zum/vorschaubild

source: Forum thumbnail:
de_de: Forum Vorschaubild:

source: Forum medium:
de_de: Forum mittlere Ansicht:

source: Forum large:
de_de: Forum große Ansicht:

source: Upload another image
de_de: Ein weiteres Bild hochladen

source: Upload failed
de_de: Upload fehlgeschlagen

source: Wrong data type
de_de: Falscher Dateityp

source: File with that name already exists
de_de: Datei mit diesem Namen bereits vorhanden

source: You have to be registered in this Blog to use this service
de_de: Sie müssen registriert sein um den Service zu nutzen
